# Combining Datasets with Pandas

Pandas provides powerful tools to combine DataFrames: merging, joining, and concatenating. Unifying data through these operations is crucial for comprehensive analysis.

This section will primarily focus on the `.merge()` method and briefly introduce `.join()` and `pd.concat()`.

## Our Practice Data: The Spongebob Squarepants Dataset

To illustrate dataset combination, we'll use synthetic data inspired by Spongebob Squarepants. These fabricated datasets will help us focus on the merging process.

**Data Files:**

* **`spongebob1.csv`**:
    * `id`: Unique identifier for each character.
    * `name`: Character's name.
    * `job`: Character's occupation.
    * `species`: Character's biological classification.

* **`spongebob2.csv`**:
    * `id`: Unique identifier for each character.
    * `name`: Character's name.
    * `age`: Character's age.
    * `personality`: General personality traits of the character.

## Getting Started

### Importing the Tools

First, let's import the Pandas library, which is essential for data manipulation in Python:

In [1]:
## Begin Example
import pandas as pd
## End Example

### Loading the Datasets

Next, we'll load the two `csv` files into separate Pandas DataFrames.

File Locations:

* `../data/spongebob1.csv`
* `../data/spongebob2.csv`

Suggested dataframe names:

* `spongebob_df1`
* `spongebob_df2`

In [2]:
## Begin Example
df1 = pd.read_csv("../data/spongebob1.csv")
df2 = pd.read_csv("../data/spongebob2.csv")

### Inspect the Datasets

Before combining, it's good practice to inspect the structure and contents of each DataFrame. Let's use the `.info()` and `.head()` methods to get a quick overview.

In [22]:
## Begin Example
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   id       4 non-null      int64
 1   name     4 non-null      object
 2   job      4 non-null      object
 3   species  4 non-null      object
dtypes: int64(1), object(3)
memory usage: 260.0+ bytes

In [24]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   id                5 non-null      int64
 1   name              5 non-null      object
 2   age               5 non-null      int64
 3   personality_type  5 non-null      object
dtypes: int64(2), object(2)
memory usage: 292.0+ bytes

In [25]:
df2.head()

   id                 name  age personality_type
0   3  Squidward Tentacles   49           Grumpy
1   4         Sandy Cheeks   27        Energetic
2   5            Mr. Krabs   78           Greedy
3   6             Plankton   52        Obsessive
4   7            Mrs. Puff   60          Anxious

In [23]:
df1.head()

   id                   name                       job     species
0   1  Spongebob Squarepants                  Fry Cook  Sea Sponge
1   2           Patrick Star  Professional Best Friend    Starfish
2   3    Squidward Tentacles                   Cashier     Octopus
3   4           Sandy Cheeks                 Scientist    Squirrel

## Combining DataFrames with `.merge()`

<center><img src="../images/illustrations/data merge illustrations.jpg"></center>

The `.merge()` method in Pandas is ideal for combining rows from two DataFrames based on shared data. It intelligently aligns rows where values in specified columns or indices match.

**Basic Structure:**

To perform a merge, you specify two primary DataFrames:

* The **left DataFrame**: The first DataFrame you are merging.
* The **right DataFrame**: The second DataFrame you are merging with.

**Controlling the Merge with Optional Arguments:**

Several optional arguments allow you to fine-tune the merging process:

* **`how`**: Defines the type of merge to be performed:
    * `inner`: Keeps only the rows where the join key(s) exist in *both* DataFrames.
    * `outer`: Includes *all* rows from both DataFrames. Where a key exists in only one DataFrame, missing values (`NaN`) are introduced for the columns of the other DataFrame.
    * `left`: Includes all rows from the *left* DataFrame, and the matching rows from the *right* DataFrame. If a key in the left DataFrame has no match in the right, the corresponding columns from the right DataFrame will have `NaN` values.
    * `right`: Similar to `left`, but includes all rows from the *right* DataFrame and the matching rows from the *left* DataFrame.

* **`on`**: Specifies the column name(s) or index level name(s) that will be used as the join key(s).
    * If no `on` argument is provided, `.merge()` will automatically use any columns that have identical names in both DataFrames as the join keys.
    * The column(s) or index level(s) specified with `on` must be present in both DataFrames.

* **`left_on`**: Specifies the column name(s) or index level name(s) in the *left* DataFrame to use as join keys.

* **`right_on`**: Specifies the column name(s) or index level name(s) in the *right* DataFrame to use as join keys. This is useful when the columns you want to join have different names in the two DataFrames.

* **`left_index`**: A boolean value. If `True`, uses the index of the *left* DataFrame as the join key(s).

* **`right_index`**: A boolean value. If `True`, uses the index of the *right* DataFrame as the join key(s).

### `.merge()` - Inner Join

<center><img src="../images/illustrations/data merge illustrations - inner.jpg"></center>

An **inner join** using `.merge()` returns only the rows where the specified join key(s) have matching values in *both* the left and the right DataFrames. 

It essentially finds the intersection of the two datasets based on the common key(s).

Let's apply `.merge()` with the default inner join to our `spongebob_df1` and `spongebob_df2` DataFrames:

In [3]:
## Begin Example
df1.merge(df2)
## End Example

   id                 name        job   species  age personality
0   3  Squidward Tentacles    Cashier   Octopus   49      Grumpy
1   4         Sandy Cheeks  Scientist  Squirrel   27   Energetic

**Note:**

By default, calling `.merge()` without any additional arguments will perform an **inner join**.

However, for clarity and explicit control, you can achieve the same result by explicitly specifying the join type using the `how='inner'` argument and indicating the joining column(s) with the `on` argument.

In [5]:
## Begin Example
df1.merge(df2, how="inner", on=["id", "name"])
## End Example

   id                 name        job   species  age personality
0   3  Squidward Tentacles    Cashier   Octopus   49      Grumpy
1   4         Sandy Cheeks  Scientist  Squirrel   27   Energetic

### `.merge()` - Outer Join

<center><img src="../images/illustrations/data merge illustrations - outer.jpg"></center>

An **outer join** using `.merge()` combines *all* rows from both the left and the right DataFrames. 

Let's perform an outer join on our spongebob DataFrames:

In [28]:
## Begin Example
df1.merge(df2, how="outer")
## End Example

,id,name,job,species,age,personality_type
0,1,Spongebob Squarepants,Fry Cook,Sea Sponge,NaN,NaN
1,2,Patrick Star,Professional Best Friend,Starfish,NaN,NaN
2,3,Squidward Tentacles,Cashier,Octopus,49.0,Grumpy
3,4,Sandy Cheeks,Scientist,Squirrel,27.0,Energetic
4,5,Mr. Krabs,NaN,NaN,78.0,Greedy
5,6,Plankton,NaN,NaN,52.0,Obsessive
6,7,Mrs. Puff,NaN,NaN,60.0,Anxious

__Note:__

If a join key exists in only one of the DataFrames, the resulting merged DataFrame will have missing values (`NaN`) in the columns originating from the DataFrame that doesn't have that key.

### `.merge()` - Left Join

<center><img src="../images/illustrations/data merge illustrations - left.jpg"></center>

A **left join** using `.merge()` includes all rows from the *left* DataFrame in the result. 

For each row in the left DataFrame, it also includes the matching rows from the *right* DataFrame based on the join key(s).

In [29]:
## Begin Example
df1.merge(df2, how = "left")
## End Example

,id,name,job,species,age,personality_type
0,1,Spongebob Squarepants,Fry Cook,Sea Sponge,NaN,NaN
1,2,Patrick Star,Professional Best Friend,Starfish,NaN,NaN
2,3,Squidward Tentacles,Cashier,Octopus,49.0,Grumpy
3,4,Sandy Cheeks,Scientist,Squirrel,27.0,Energetic

**Note**:

If a row in the left DataFrame has no matching key in the right DataFrame, the columns from the right DataFrame will have missing values (`NaN`).

### `.merge()` - Right Join

<center><img src="../images/illustrations/data merge illustrations - right.jpg"></center>

A **right join** using `.merge()` includes all rows from the *right* DataFrame in the result. 

For each row in the right DataFrame, it also includes the matching rows from the *left* DataFrame based on the join key(s).

In [30]:
## Begin Example
df1.merge(df2, how = "right")
## End Example

   id                 name        job   species  age personality_type
0   3  Squidward Tentacles    Cashier   Octopus   49           Grumpy
1   4         Sandy Cheeks  Scientist  Squirrel   27        Energetic
2   5            Mr. Krabs        NaN       NaN   78           Greedy
3   6             Plankton        NaN       NaN   52        Obsessive
4   7            Mrs. Puff        NaN       NaN   60          Anxious

**Note**:

If a row in the right DataFrame has no matching key in the left DataFrame, the columns from the left DataFrame will have missing values (`NaN`).

### `.merge()` - Cross Join

<center><img src="../images/illustrations/data merge illustrations cross.jpg"></center>

A **cross join** using `.merge()` produces the Cartesian product of the rows from the left and right DataFrames. 

This means that every row from the left DataFrame is combined with every row from the right DataFrame, resulting in a DataFrame where the number of rows is the product of the number of rows in the two original DataFrames.

In [31]:
## Begin Example
df1.merge(df2, how = "cross")
## End Example

,id_x,name_x,job,species,id_y,name_y,age,personality_type
0,1,Spongebob Squarepants,Fry Cook,Sea Sponge,3,Squidward Tentacles,49,Grumpy
1,1,Spongebob Squarepants,Fry Cook,Sea Sponge,4,Sandy Cheeks,27,Energetic
2,1,Spongebob Squarepants,Fry Cook,Sea Sponge,5,Mr. Krabs,78,Greedy
3,1,Spongebob Squarepants,Fry Cook,Sea Sponge,6,Plankton,52,Obsessive
4,1,Spongebob Squarepants,Fry Cook,Sea Sponge,7,Mrs. Puff,60,Anxious
5,2,Patrick Star,Professional Best Friend,Starfish,3,Squidward Tentacles,49,Grumpy
6,2,Patrick Star,Professional Best Friend,Starfish,4,Sandy Cheeks,27,Energetic
7,2,Patrick Star,Professional Best Friend,Starfish,5,Mr. Krabs,78,Greedy
8,2,Patrick Star,Professional Best Friend,Starfish,6,Plankton,52,Obsessive
9,2,Patrick Star,Professional Best Friend,Starfish,7,Mrs. Puff,60,Anxious
10,3,Squidward Tentacles,Cashier,Octopus,3,Squidward Tentacles,49,Grumpy
11,3,Squidward Tentacles,Cashier,Octopus,4,Sandy Cheeks,27,Energetic
12,3,Squidward Tentacles,Cashier,Octopus,5,Mr. Krabs,78,Greedy
13,3,Squidward Tentacles,Cashier,Octopus,6,Plankton,52,Obsessive
14,3,Squidward Tentacles,Cashier,Octopus,7,Mrs. Puff,60,Anxious
15,4,Sandy Cheeks,Scientist,Squirrel,3,Squidward Tentacles,49,Grumpy
16,4,Sandy Cheeks,Scientist,Squirrel,4,Sandy Cheeks,27,Energetic
17,4,Sandy Cheeks,Scientist,Squirrel,5,Mr. Krabs,78,Greedy
18,4,Sandy Cheeks,Scientist,Squirrel,6,Plankton,52,Obsessive
19,4,Sandy Cheeks,Scientist,Squirrel,7,Mrs. Puff,60,Anxious

__Note__:

The resulting table will contain rows equivalent to the product of the number of rows in the original dataframes.

For a more practical example let's load up two additional datasets, each contain menu items from the Krusty Krab.

**File Locations**:
1. `../data/krustykrab1.csv`
2. `../data/krustykrab2.csv`

**Recommended DataFrame Names:
1. `krusty_krab_df1`
2. `krusty_krab_df2`

In [14]:
## Begin Example
file1 = "../data/krustykrab1.csv"
file2 = "../data/krustykrab2.csv"

krusty_krab_df1 = pd.read_csv(file1)
krusty_krab_df2 = pd.read_csv(file2)
## End Example

In [15]:
print(krusty_krab_df1.head())
print(krusty_krab_df2.head())

                entree
0         Krabby Patty
1  Double Krabby Patty
2  Triple Krabby Patty
               sides
0         Coral Bits
1         Kelp Rings
2  Sailor's Surprise
3         Kelp Shake

Now let's follow up with `.merge()` using a Cross Join.

In [16]:
## Begin Example
krusty_krab_df1.merge(krusty_krab_df2, how = "cross")
## End Example

                 entree              sides
0          Krabby Patty         Coral Bits
1          Krabby Patty         Kelp Rings
2          Krabby Patty  Sailor's Surprise
3          Krabby Patty         Kelp Shake
4   Double Krabby Patty         Coral Bits
5   Double Krabby Patty         Kelp Rings
6   Double Krabby Patty  Sailor's Surprise
7   Double Krabby Patty         Kelp Shake
8   Triple Krabby Patty         Coral Bits
9   Triple Krabby Patty         Kelp Rings
10  Triple Krabby Patty  Sailor's Surprise
11  Triple Krabby Patty         Kelp Shake

The resulting DataFrame should reveal all the possible meal combinations based on our two dataframes.

## Introducing `.join()`

The `.join()` method in Pandas provides another way to combine DataFrames. 

While its functionality overlaps with `.merge()`, it has a key distinction: **`.join()` primarily combines DataFrames based on their indices.**

**Key Differences from `.merge()`:**

* **Default Join Key:** `.join()` defaults to joining on the **index** of the DataFrames. `.merge()`, on the other hand, defaults to joining on columns with the same name.
* **Flexibility with Columns:** While `.join()` can also join on columns using the `on` argument, `.merge()` offers more flexibility in specifying different columns from the left and right DataFrames using `left_on` and `right_on`.

### Basic Usage

You typically call `.join()` on one DataFrame and pass the other DataFrame as an argument:

```python
joined_df = left_df.join(right_df, how='...', lsuffix='...', rsuffix='...')
```

__Key Arguments:__

* __other__: The DataFrame to join with.
* __how__: Specifies the type of join (`left`, `right`, `inner`, `outer`), similar to .merge(). It determines which keys are included in the resulting DataFrame.
* __on__: An optional argument to specify a column or a list of columns to join on. These columns must be in the calling DataFrame. The other DataFrame will join on its index based on the values in this column.
* __lsuffix__: A string suffix to apply to overlapping column names in the calling DataFrame.
* __rsuffix__: A string suffix to apply to overlapping column names in the other DataFrame. These suffixes help distinguish columns with the same name after the join.

In essence, use `.join()` when you want to combine DataFrames primarily based on their index values. 

If you need more explicit control over the join columns or want to join on different columns in the two DataFrames, `.merge()` is generally the more versatile option.

Let's perform an inner join with `.join()` to view the results versus a `.merge()`.

In [19]:
df1.join(df2, how="inner", lsuffix="_left", rsuffix="_right")

,id_left,name_left,job,species,id_right,name_right,age,personality
0,1,Spongebob Squarepants,Fry Cook,Sea Sponge,3,Squidward Tentacles,49,Grumpy
1,2,Patrick Star,Professional Best Friend,Starfish,4,Sandy Cheeks,27,Energetic
2,3,Squidward Tentacles,Cashier,Octopus,5,Mr. Krabs,78,Greedy
3,4,Sandy Cheeks,Scientist,Squirrel,6,Plankton,52,Obsessive

## `pd.concat()`

The `pd.concat()` function in pandas is used to combine pandas objects (like DataFrames or Series) along a specified axis. 

It's like "stacking" or "gluing" them together.

## Vertical Stacking

Let's use our Krusty Krab menu items. We'll combine the entree items and menu items into one dataset.

In [36]:
file1 = "../data/bikinibottom1.csv"
file2 = "../data/bikinibottom2.csv"

locations_df1 = pd.read_csv(file1)
locations_df2 = pd.read_csv(file2)

pd.concat([locations_df1, locations_df2])

   index              place_name             type
0      0             Krusty Krab       Restaurant
1      1             Chum Bucket       Restaurant
2      2           Salty Spitoon              Bar
3      3        Jellyfish Fields             Park
4      0              Goo Lagoon            Beach
5      1             Rock Bottom          Unknown
6      2  Shady Shoals Rest Home  Retirement Home
7      3               Mermalair      Secret Base

## Horizontal Stacking

In [30]:

horizontal_combined_spongebob = pd.concat([df1,
df2], axis = 1)
horizontal_combined_spongebob

,name,job,species,name,age,personality
id,,,,,,
1,Spongebob Squarepants,Fry Cook,Sea Sponge,NaN,NaN,NaN
2,Patrick Star,Professional Best Friend,Starfish,NaN,NaN,NaN
3,Squidward Tentacles,Cashier,Octopus,Squidward Tentacles,49.0,Grumpy
4,Sandy Cheeks,Scientist,Squirrel,Sandy Cheeks,27.0,Energetic
5,NaN,NaN,NaN,Mr. Krabs,78.0,Greedy
6,NaN,NaN,NaN,Plankton,52.0,Obsessive
7,NaN,NaN,NaN,Mrs. Puff,60.0,Anxious

`pd.concat()` is a fundamental tool for combining data in pandas, either by adding more rows or more columns.

The `axis` parameter is key to controlling this behavior.